---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.GetFieldOrder
source: html/3549fb1c-fea6-5b64-a8a9-700337a3907e.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.GetFieldOrder Method

Gets the IDs of the current list of fields in order.

## Syntax (C#)
```csharp
public IList<ScheduleFieldId> GetFieldOrder()
```

## Returns
The IDs of the current list of fields.